Tekla.Structures.AnalysisInternal.DotAnalysisEngine.OperationEnum
The operation type.

Tekla.Structures.AnalysisInternal.DotAnalysisEngine.OperationEnum.Insert
Insert

Tekla.Structures.AnalysisInternal.DotAnalysisEngine.OperationEnum.Modify
Modify

Tekla.Structures.AnalysisInternal.DotAnalysisEngine.OperationEnum.Delete
Delete

Tekla.Structures.AnalysisInternal.DotAnalysisEngine.OperationEnum.Select
Select